# 1. Import Libraries and Data

In [1]:
# Import liraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# import path folder as 'path'
path = r'C:\Users\mojis\Documents\09-2022-Instacart Basket Analysis(Task 4 careerfoundary)'

In [3]:
# import customer dataframe
cus = pd.read_csv(os.path.join(path,'02 Data','original data(raw)','customers.csv'), index_col = False)

# 2. Customers' dataframe profiling

In [4]:
# Checking first 5 rows
cus.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
# checking data frame dimension
cus.shape

(206209, 10)

In [6]:
# checking the basic statistic
cus.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [7]:
# check dataframe basic information
cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

# 3. Data Wrangling

In [8]:
# user_id type changed to string
cus['user_id'] = cus['user_id'].astype('str')

In [9]:
cus['user_id'].dtype

dtype('O')

#### 3b Wrangle data - rename columns with illogical names and drop columns

In [10]:
# looking for unintuitive name
cus.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [11]:
# rename first name column with first_name
cus.rename(columns={'First Name':'first_name'}, inplace = True)

In [12]:
# rename Surnam with last_name
cus.rename(columns = {'Surnam':'last_name'}, inplace = True)

In [13]:
# rename Gender with gender
cus.rename(columns = {'Gender':'gender'}, inplace = True)

In [14]:
#rename STATE with state
cus.rename(columns = {'STATE':'state'}, inplace = True)

In [15]:
# rename Age with age
cus.rename(columns = {'Age':'age'}, inplace = True)

In [16]:
# rename n_dependents with no_of_dependendents
cus.rename(columns = {'n_dependants':'no_of_dependents'}, inplace = True)

In [17]:
#rename fam_status with marital_status
cus.rename(columns = {'fam_status':'marital_status'}, inplace = True)

In [18]:
# check columns
cus.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'no_of_dependents', 'marital_status', 'income'],
      dtype='object')

# 4. Data quality and consistency checks

##### check missing , duplicate and mixed type data

In [19]:
# find and save duplicates rows within cus_dups dataframe.
cus_dups = cus[cus.duplicated()]

In [20]:
# Duplicates
cus_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, no_of_dependents, marital_status, income]
Index: []

In [21]:
#checking dimension for cus_dups dataframe
cus_dups.shape

(0, 10)

##### No duplicates

In [22]:
# checking for duplicate value in customers' dataframe
cus.isnull(). sum()

user_id                 0
first_name          11259
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
no_of_dependents        0
marital_status          0
income                  0
dtype: int64

In [23]:
# Creating a subset of dataframe that contains missing values
cus_nan = cus[cus['first_name'].isnull()==True]

In [24]:
# checking dimension of missing values dataframe
cus_nan.shape

(11259, 10)

###### 11259 missing values(NAN)

In [25]:
cus_nan

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependents,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [26]:
# Check for mixed types in customers' dataframe
for col in cus.columns.tolist():
  weird = (cus[[col]].applymap(type) != cus[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cus[weird]) > 0:
    print (col)

first_name

#### first_name has mixed data type

In [27]:
# check data type of first_name
cus['first_name'].dtype

dtype('O')

In [28]:
# changing first_name data type tp string
cus['first_name'] = cus['first_name'].astype('str')

In [29]:
# Re-Check for mixed types in customers' dataframe
for col in cus.columns.tolist():
  weird = (cus[[col]].applymap(type) != cus[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cus[weird]) > 0:
    print (col)

In [30]:
# check again for missing values in customers' dataframe
cus.isnull(). sum()

user_id             0
first_name          0
last_name           0
gender              0
state               0
age                 0
date_joined         0
no_of_dependents    0
marital_status      0
income              0
dtype: int64

# 5. Combine customer data with the prepared instacart data

In [31]:
# import orders_products_merge_recent dataframe as ords_prods_merge
ords_prods_merge = pd.read_pickle(r'C:\Users\mojis\Documents\09-2022-Instacart Basket Analysis(Task 4 careerfoundary)\02 Data\Prepared Data(cleaned)\orders_products_merge_3.pkl')

In [32]:
# check dimension
ords_prods_merge.shape

(32404859, 24)

In [33]:
# fist few rows for orders_products_merge data
ords_prods_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,price_range_loc,busiest_day,Busiest_days,Busiest_period_of_day,max_order,loyalty_flag,Average_prices,spender_flag,median_days_since_prior_order,order_frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid-range product,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid-range product,Regularly busy,Regularly busy,Average orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid-range product,Busiest day,Two busiest days,Average orders,5,New customer,7.930208,Low spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid-range product,Regularly busy,Two slowest days,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid-range product,Least busy,Two slowest days,Average orders,3,New customer,4.972414,Low spender,9.0,Frequent customer

In [34]:
# checking user_id datatype in orders_products_merged dataframe 
ords_prods_merge['user_id'].dtype

dtype('int64')

In [35]:
# user_id type changed to string
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [36]:
# first few rows of customers' data
cus.head()

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependents,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

#### 5b. Merging process ( common column is user_id)

In [37]:
# Merging ords_prods_merge and customers' dataframe
df_merged = ords_prods_merge.merge(cus, on = 'user_id')

In [38]:
# checking dimension of new data frame
df_merged.shape

(32404859, 33)

In [39]:
# checking first few row
df_merged.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,order_frequency_flag,first_name,last_name,gender,state,age,date_joined,no_of_dependents,marital_status,income
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
2,907,Premium Sliced Bacon,106,12,20.0,3160996,138,1,5,13,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
3,907,Premium Sliced Bacon,106,12,20.0,2254091,138,10,5,14,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
4,1000,Apricots,18,10,12.9,505689,138,9,6,12,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620

In [40]:
# checking if all is full match
df_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

# 6. Exporting Data

In [41]:
df_merged.to_pickle(r'C:\Users\mojis\Documents\09-2022-Instacart Basket Analysis(Task 4 careerfoundary)\02 Data\Prepared Data(cleaned)\orders_products_customers.pkl')